In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [7]:
ser = pd.Series(np.arange(3.))

In [3]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [4]:
ser2[-1]

2.0

In [8]:
ser[-1]

KeyError: -1

In [9]:
ser.iloc[-1]

2.0

In [10]:
ser[:2]

0    0.0
1    1.0
dtype: float64

In [11]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])

In [12]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [13]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [14]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [15]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [16]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [17]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [18]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [19]:
df1 = pd.DataFrame({'A': [1, 2]})

df2 = pd.DataFrame({'B': [3, 4]})

In [20]:
df1

   A
0  1
1  2

In [21]:
df2

   B
0  3
1  4

In [22]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [23]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))

df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [24]:
df2.loc[1, 'b'] = np.nan

In [25]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [26]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [27]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [28]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [29]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [30]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [31]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [32]:
arr = np.arange(12.).reshape((3, 4))

arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [33]:
arr[0]

array([0., 1., 2., 3.])

In [34]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [35]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [36]:
series = frame.iloc[0]

In [37]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [38]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [39]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [40]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [41]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [42]:
series3 = frame['d']

In [43]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [44]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [45]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [46]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [47]:
frame

               b         d         e
Utah   -0.908855  0.589388 -0.635954
Ohio    0.316094 -0.821281 -1.177862
Texas   0.569957 -1.111788 -2.201411
Oregon  0.277529  0.226691  0.019248

In [48]:
np.abs(frame)

               b         d         e
Utah    0.908855  0.589388  0.635954
Ohio    0.316094  0.821281  1.177862
Texas   0.569957  1.111788  2.201411
Oregon  0.277529  0.226691  0.019248

In [49]:
f = lambda x: x.max() - x.min()

In [50]:
frame.apply(f)

b    1.478813
d    1.701177
e    2.220659
dtype: float64

In [51]:
frame.apply(f, axis='columns')

Utah      1.498244
Ohio      1.493955
Texas     2.771369
Oregon    0.258282
dtype: float64

In [52]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [53]:
frame.apply(f)

            b         d         e
min -0.908855 -1.111788 -2.201411
max  0.569957  0.589388  0.019248

In [54]:
format = lambda x: '%.2f' % x

In [55]:
frame.applymap(format)

            b      d      e
Utah    -0.91   0.59  -0.64
Ohio     0.32  -0.82  -1.18
Texas    0.57  -1.11  -2.20
Oregon   0.28   0.23   0.02

In [56]:
frame['e'].map(format)

Utah      -0.64
Ohio      -1.18
Texas     -2.20
Oregon     0.02
Name: e, dtype: object

In [57]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [58]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [59]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [60]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [61]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [62]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [63]:
obj = pd.Series([4, 7, -3, 2])

In [64]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [65]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [66]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [67]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [68]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [69]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [70]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [71]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [72]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [73]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [74]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [75]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})

In [76]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [77]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [78]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [79]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [80]:
obj.index.is_unique

False

In [81]:
obj['a']

a    0
a    1
dtype: int64

In [82]:
obj['c']

4

In [83]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [84]:
df

          0         1         2
a  0.551483  0.151240 -2.010650
a  1.413620 -0.872219  1.088664
b  0.239740 -0.708831 -0.362436
b  0.121156 -0.158183  1.059560

In [85]:
df.loc['b']

          0         1         2
b  0.239740 -0.708831 -0.362436
b  0.121156 -0.158183  1.059560